// Задача 2: Напишите программу, которая на вход принимает 
// два числа и выдаёт, какое число большее, а какое меньшее.

/*
Console.WriteLine("Input a first number");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input a second number");
int num2 = Convert.ToInt32(Console.ReadLine());

int max = num1;

while (max < num2)
{
  Console.WriteLine(max = num2);
  Console.WriteLine("max = " + num2);
  Console.WriteLine("min = "+ num1);
}
*/
